---
title: KeyBasedTreeEntryError
classe: Autodesk.Revit.DB.KeyBasedTreeEntryError
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# KeyBasedTreeEntryError

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyBasedTreeEntryErrorType ErrorType { get; }` | `keyBasedTreeEntryError.ErrorType` | KeyBasedTreeEntryErrorType |
| `Boolean IsValidObject { get; }` | `keyBasedTreeEntryError.IsValidObject` | Boolean |
| `Void Dispose()` | `keyBasedTreeEntryError.Dispose()` | Void |
| `KeyBasedTreeEntry GetEntry()` | `keyBasedTreeEntryError.GetEntry()` | KeyBasedTreeEntry |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```